# SystemsAnalysisOptions Class

---
Contains the options for systems analysis.
SystemObject Autodesk.Revit.DB.AnalysisSystemsAnalysisOptions
**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

    public class SystemsAnalysisOptions : IDisposable

    Public Class SystemsAnalysisOptions
    	Implements IDisposable

    public ref class SystemsAnalysisOptions : IDisposable

    type SystemsAnalysisOptions =
        class
            interface IDisposable
        end
The SystemsAnalysisOptions type exposes the following members.
| Name| Description
---|---|---
| SystemsAnalysisOptions|  Constructs a new instance of the options.
Top
| Name| Description
---|---|---
| IsValidObject|  Specifies whether the .NET object represents a valid Revit entity.
| OutputFolder|  The path of the output folder for systems analysis.
| WeatherFile|  The file name of the EnergyPlus weather (*.epw).
| WorkflowFile|  The file name of the EnergyPlus workflow script.
Top
| Name| Description
---|---|---
| Dispose| Releases all resources used by the SystemsAnalysisOptions
| Equals| Determines whether the specified object is equal to the current object.(Inherited from Object)
| GetHashCode| Serves as the default hash function.(Inherited from Object)
| GetType| Gets the Type of the current instance.(Inherited from Object)
| ToString| Returns a string that represents the current object.(Inherited from Object)
Top
#### Reference
Autodesk.Revit.DB.Analysis Namespace